In [1]:
# null값 처리

In [2]:
# import
import pandas as pd
import numpy as np

import datetime 
from datetime import datetime, date

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
df = pd.DataFrame(np.arange(0,15).reshape(5,3), index=['a', 'b', 'c', 'd', 'e'], columns=['c1', 'c2', 'c3'])
df['c4'] = np.nan
df.loc['f'] = np.nan
df.loc['g'] = np.nan
df['c5'] = np.nan
df['c4']['a'] = 20
df['c5']['b'] = 5

In [4]:
df.isnull()

      c1     c2     c3     c4     c5
a  False  False  False  False   True
b  False  False  False   True  False
c  False  False  False   True   True
d  False  False  False   True   True
e  False  False  False   True   True
f   True   True   True   True   True
g   True   True   True   True   True

In [5]:
df.isnull().sum().sum()

18

In [6]:
df.notnull()

      c1     c2     c3     c4     c5
a   True   True   True   True  False
b   True   True   True  False   True
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f  False  False  False  False  False
g  False  False  False  False  False

In [11]:
df.c4[df.c4.notnull()]

a    20.0
Name: c4, dtype: float64

In [12]:
df.c4[df.c4.isnull()]

b   NaN
c   NaN
d   NaN
e   NaN
f   NaN
g   NaN
Name: c4, dtype: float64

In [15]:
df.c4.dropna()
df.dropna(how='all')

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  NaN
b   3.0   4.0   5.0   NaN  5.0
c   6.0   7.0   8.0   NaN  NaN
d   9.0  10.0  11.0   NaN  NaN
e  12.0  13.0  14.0   NaN  NaN

In [16]:
df.dropna(how='any')

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

In [19]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g]

In [20]:
df.dropna(axis = 1, how='all')

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  NaN
b   3.0   4.0   5.0   NaN  5.0
c   6.0   7.0   8.0   NaN  NaN
d   9.0  10.0  11.0   NaN  NaN
e  12.0  13.0  14.0   NaN  NaN
f   NaN   NaN   NaN   NaN  NaN
g   NaN   NaN   NaN   NaN  NaN

In [21]:
df.dropna(axis = 1, how='any')

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g]

In [22]:
df2 = df.copy()

In [23]:
df2['c5'] = np.nan

In [24]:
df2.loc['g'].c1 = 0
df2.loc['g'].c3 = 0

In [31]:
df2.loc['f'] = 2

In [32]:
df2.loc['f'].c5 = np.nan

In [33]:
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f   2.0   2.0   2.0   2.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [35]:
df2.dropna(thresh=5, axis=1)

     c1    c2    c3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f   2.0   2.0   2.0
g   0.0   NaN   0.0

In [40]:
df_fill = df2.fillna(0)

In [41]:
df2.mean() # nan값은 무시하고 평균계산

c1     4.571429
c2     6.166667
c3     6.000000
c4    11.000000
c5          NaN
dtype: float64

In [42]:
df_fill.mean() # 0을 포함하여 평균계산

c1    4.571429
c2    5.285714
c3    6.000000
c4    3.142857
c5    0.000000
dtype: float64

In [43]:
df = df2.copy()

In [44]:
df.c4.fillna(method='ffill')

a    20.0
b    20.0
c    20.0
d    20.0
e    20.0
f     2.0
g     2.0
Name: c4, dtype: float64

In [49]:
fill_val = pd.Series([100,101,102,103,104], index=['b','c','d', 'e', 'g'])
fill_val

b    100
c    101
d    102
e    103
g    104
dtype: int64

In [50]:
df.c4

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f     2.0
g     NaN
Name: c4, dtype: float64

In [51]:
df.c4.fillna(fill_val)

a     20.0
b    100.0
c    101.0
d    102.0
e    103.0
f      2.0
g    104.0
Name: c4, dtype: float64

In [53]:
df.fillna(df.mean()) # 전부 null인 컬럼은 채워지지 않는다. 평균이 없다

     c1         c2    c3    c4  c5
a   0.0   1.000000   2.0  20.0 NaN
b   3.0   4.000000   5.0  11.0 NaN
c   6.0   7.000000   8.0  11.0 NaN
d   9.0  10.000000  11.0  11.0 NaN
e  12.0  13.000000  14.0  11.0 NaN
f   2.0   2.000000   2.0   2.0 NaN
g   0.0   6.166667   0.0  11.0 NaN

# interpolation

In [54]:
# null값을 같은 비율로 증감시켜 채워준다
s = pd.Series([1, np.nan, np.nan, np.nan, 2])
s.interpolate()

0    1.00
1    1.25
2    1.50
3    1.75
4    2.00
dtype: float64

In [56]:
ts = pd.Series([1,np.nan, 2], index=[datetime(2014,1,1), datetime(2014,2,1), datetime(2014,4,1)])
ts.interpolate(method ='time') # 시간에 비례해 채우기

2014-01-01    1.000000
2014-02-01    1.344444
2014-04-01    2.000000
dtype: float64

In [58]:
s = pd.Series([0, np.nan, 100], index=[0,1,10])
s.interpolate(method = 'values') # index에 비례해 채우기

0       0.0
1      10.0
10    100.0
dtype: float64

### duplicate data

In [59]:
data = pd.DataFrame({'a':['x']*3+['y']*4, 'b':[1,1,2,3,3,4,4]})
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [60]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [61]:
data.drop_duplicates()

   a  b
0  x  1
2  x  2
3  y  3
5  y  4

In [62]:
data.drop_duplicates(keep='last')

   a  b
1  x  1
2  x  2
4  y  3
6  y  4

In [63]:
data['c'] = range(7)
data

   a  b  c
0  x  1  0
1  x  1  1
2  x  2  2
3  y  3  3
4  y  3  4
5  y  4  5
6  y  4  6

In [64]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [65]:
data.drop_duplicates(['a', 'b'], keep='last')

   a  b  c
1  x  1  1
2  x  2  2
4  y  3  4
6  y  4  6

### Mapping

In [66]:
x = pd.Series({'one':1, 'two':2, 'three':3 })
y = pd.Series({1:'a', 2:'b', 3:'c'})
print(x)
print(y)

one      1
two      2
three    3
dtype: int64
1    a
2    b
3    c
dtype: object

In [69]:
x.map(y)

one      a
two      b
three    c
dtype: object

In [70]:
x = pd.Series({'one':1, 'two':2, 'three':3 })
y = pd.Series({1:'a', 2:'b'})
print(x)
print(y)

one      1
two      2
three    3
dtype: int64
1    a
2    b
dtype: object

In [71]:
x.map(y)
# 값에 해당하는 인덱스가 없으면 nan이 된다

one        a
two        b
three    NaN
dtype: object

### replace()

In [73]:
s = pd.Series([0,1,2,3,4])
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [74]:
s.replace(2,5)

0    0
1    1
2    5
3    3
4    4
dtype: int64

In [75]:
s.replace([z for z in range(5)], [4-z for z in range(5)])

0    4
1    3
2    2
3    1
4    0
dtype: int64

In [76]:
s.replace({0:10, 1:100})

0     10
1    100
2      2
3      3
4      4
dtype: int64

In [77]:
df = pd.DataFrame({'a':[x for x in range(5)], 'b':[x for x in range(5,10)]})
df

   a  b
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [78]:
df['a'].replace(3,5)

0    0
1    1
2    2
3    5
4    4
Name: a, dtype: int64

In [81]:
df.replace({'a':[1,2], 'b':(8,9)}, 100) #a열의 1, b열의 8을 100으로 바꾸기

     a    b
0    0    5
1  100    6
2  100    7
3    3  100
4    4  100

In [84]:
df.replace({0:5, 4:4},100)

   a  b
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [91]:
s.replace([1,3,2], method='pad') # 앞의 값으로 바꾸기

0    0
1    0
2    0
3    0
4    4
dtype: int64

In [87]:
s.replace([1,2,3], method='bfill')

0    0
1    4
2    4
3    4
4    4
dtype: int64

### apply()

In [92]:
s = pd.Series(np.arange(0,5))

In [93]:
s.apply(lambda x: x*2)

0    0
1    2
2    4
3    6
4    8
dtype: int64

In [95]:
s.apply(lambda x: x*2 if x%2==0 else x)

0    0
1    1
2    4
3    3
4    8
dtype: int64

In [96]:
df = pd.DataFrame(np.arange(12).reshape(4,3), columns=['a','b','c'])
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [97]:
df.a.apply(lambda x:x*2)

0     0
1     6
2    12
3    18
Name: a, dtype: int64

In [98]:
df.apply(lambda x:x.sum())

a    18
b    22
c    26
dtype: int64

In [99]:
df.sum()

a    18
b    22
c    26
dtype: int64

In [100]:
df.apply(sum)

a    18
b    22
c    26
dtype: int64

In [101]:
df.apply(lambda r:r.sum(), axis=1)

0     3
1    12
2    21
3    30
dtype: int64

In [103]:
df['interim'] = df.apply(lambda r: r.a*r.b, axis=1)
df

   a   b   c  interim
0  0   1   2        0
1  3   4   5       12
2  6   7   8       42
3  9  10  11       90

In [104]:
df['inter'] = df.a * df.b
print(df)
del df['inter']

   a   b   c  interim  int
0  0   1   2        0    0
1  3   4   5       12   12
2  6   7   8       42   42
3  9  10  11       90   90

In [107]:
df = pd.DataFrame(np.arange(0,15).reshape(3,5))
df.loc[1,2] = np.nan
df

    0   1     2   3   4
0   0   1   2.0   3   4
1   5   6   NaN   8   9
2  10  11  12.0  13  14

In [108]:
df.dropna().apply(sum, axis=1)
# df.dropna().sum(axis=1)

0    10.0
2    60.0
dtype: float64

In [112]:
df.applymap(lambda x:'{0:.2f}'.format(x))

       0      1      2      3      4
0   0.00   1.00   2.00   3.00   4.00
1   5.00   6.00    nan   8.00   9.00
2  10.00  11.00  12.00  13.00  14.00

In [114]:
df.apply(lambda r:r.apply(lambda x:'{0:.2f}'.format(x) ))

       0      1      2      3      4
0   0.00   1.00   2.00   3.00   4.00
1   5.00   6.00    nan   8.00   9.00
2  10.00  11.00  12.00  13.00  14.00